In [12]:
# Import libraries
import pyodbc as py
import pandas as pd

In [13]:
# Create connection to Microsoft SQL Database
cnxn = py.connect("DRIVER={ODBC Driver 17 for SQL Server};"
                  "SERVER=DESKTOP-1UTCB6C;"
                  "DATABASE=AdventureWorks2017;"
                  "TRUSTED_Connection=yes;")

In [14]:
# From https://docs.microsoft.com/en-us/sql/relational-databases/performance/subqueries?view=sql-server-ver15
# "Subqueries with IN" The following query finds the names of all the wheel products that AdventureWorks makes
Wheels = pd.read_sql_query('SELECT p.Name AS PName, s.Name AS SName FROM Production.Product AS p INNER JOIN Production.ProductSubcategory AS s ON p.ProductSubcategoryID = s.ProductSubcategoryID', cnxn)

# AND s.Name = 'Wheels'

In [15]:
# Quick Preview of dataframe
Wheels.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 295 entries, 0 to 294
Data columns (total 2 columns):
PName    295 non-null object
SName    295 non-null object
dtypes: object(2)
memory usage: 4.7+ KB

In [16]:
# Quick Preview of dataframe
Wheels.head()

                       PName        SName
0  HL Road Frame - Black, 58  Road Frames
1    HL Road Frame - Red, 58  Road Frames
2      Sport-100 Helmet, Red      Helmets
3    Sport-100 Helmet, Black      Helmets
4     Mountain Bike Socks, M        Socks

In [17]:
# Final query to represent the data as the website reference
Wheels.loc[Wheels['SName'] == 'Wheels'].head()

                       PName   SName
110  LL Mountain Front Wheel  Wheels
111  ML Mountain Front Wheel  Wheels
112  HL Mountain Front Wheel  Wheels
113      LL Road Front Wheel  Wheels
114      ML Road Front Wheel  Wheels

In [18]:
# From https://docs.microsoft.com/en-us/sql/relational-databases/performance/subqueries?view=sql-server-ver15
# Following query finds the name of all vendors whose credit rating is good, from whom AdventureWorks orders at least 20 items, and who delivers within 16 days
Goodcredit = pd.read_sql_query('SELECT Name FROM Purchasing.Vendor WHERE CreditRating = 1 AND BusinessEntityID IN (SELECT BusinessEntityID FROM Purchasing.ProductVendor WHERE MinOrderQty >= 20 AND AverageLeadTime < 16)', cnxn)

In [19]:
# Quick Preview of dataframe
Goodcredit.head()

                        Name
0   Compete Enterprises, Inc
1  International Trek Center
2   First National Sport Co.
3      Comfort Road Bicycles
4             Circuit Cycles